trade_exp/src/DataProcessors/БезналичнаяОплатаБезПодключенияОборудования/БезналичнаяОплатаБезПодключенияОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>БезналичнаяОплатаБезПодключенияОборудования</name>
</mdclass:DataProcessor>

trade_exp/src/Enums/СтатусыКассовойСмены/СтатусыКассовойСмены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыКассовойСмены</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Открыта</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/СтатусыЧековККМ/СтатусыЧековККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыЧековККМ</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Пробит</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="994ecf6c-34a9-4274-952e-8a44959ddd3d">
    <name>КОплате</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="238e807a-b6d8-401c-b115-0e10b84a16c1">
    <name>ОтложенБезРезервирования</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b8d448b2-f4c4-4fef-bd83-69bf834a37d5">
    <name>ОтложенСРезервированием</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/ТипыНалогообложенияНДС/ТипыНалогообложенияНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыНалогообложенияНДС</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ПродажаОблагаетсяЕНВД</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПродажаОблагаетсяНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПродажаНеОблагаетсяНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПродажаНаЭкспорт</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВводОСВЭксплуатацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НалоговыйАгентПоНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОблагаетсяНДСУПокупателя</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="4023d8d4-9e71-4a9b-b0b9-205c28e22f29">
    <name>ЭкспортСырьевыхТоваровУслуг</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="540bf057-2915-4a0d-8b55-1833fc259d70">
    <name>ЭкспортНесырьевыхТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/ФормыОплаты/ФормыОплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8cd09e10-4636-4941-882a-e1d11a583f37">
  <name>ФормыОплаты</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Наличная</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Безналичная</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПлатежнаяКарта</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Смешанная</name>
  </enumValues>
  <enumValues extendedConfigurationObject="551e55ef-70ce-48b5-bd48-20a0855bac13">
    <name>ПодарочныйСертификат</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="09285a09-9587-4f41-933d-ff6223c6983f">
    <name>БонусныеБаллы</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/ТипыПлатежнойСистемыККТ/ТипыПлатежнойСистемыККТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="17d6d642-f9f4-4184-9494-c31448761a97">
  <name>ТипыПлатежнойСистемыККТ</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="fc13509e-eb4f-4d15-beb7-65b67ba34e89">
    <name>ПлатежнаяКарта</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e225080a-7355-4bd6-93f0-9701a233c00a">
    <name>СертификатНСПК</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="058b36d9-0f38-4998-bd16-e38c9448a1ce">
    <name>СистемаБыстрыхПлатежей</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Documents/КассоваяСмена/КассоваяСмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>КассоваяСмена</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КассаККМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Document>

trade_exp/src/Documents/ЧекККМВозврат/ЧекККМВозврат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЧекККМВозврат</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.ДвижениеМаркированногоТовара</registerRecords>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЧекККМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПричинаДляОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПричинаДляОрганизацииСпр</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КартаЛояльности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаБонусныхБалловКВозврату</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КассоваяСмена</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КассаККМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГлавныйБухгалтер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Кассир</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d6efd4c0-aadb-4fbc-bab2-5bb6f02a424f">
    <name>СторноОрдер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="017fb748-2a94-46b5-a01d-8eaba05eaa20">
    <name>ИсключитьИзКонтроля</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="60dd2802-f9c1-435e-923c-d459e0c47112">
    <name>ДатаПоследнегоОткрытия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a8c72a24-a385-45d4-9b74-f0036e4d090c">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e2838228-73ec-4d7e-9180-86f69e84dd8e">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d5501ee7-ab3c-46cd-b2a5-2895d1a748a2">
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="37bb3306-a9d4-4d76-ab58-8b95bdb8edf4">
    <name>ПодразделениеМенеджера</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="55fa59b5-6609-46c8-8c2e-e86b95d64bed">
    <name>ОтделМенеджера</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ХарактеристикаНабора</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НоменклатураЕГАИС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НоменклатураНабора</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>200</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Продавец</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Помещение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="285439ea-2699-4a2a-b693-b5ca7dcf27c1">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОплатаПлатежнымиКартами</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ЭквайринговыйТерминал</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОплатаОтменена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КодАвторизации</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>6</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СсылочныйНомер</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерПлатежнойКарты</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>22</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерЧекаЭТ</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>10</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>БонусныеБаллы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ДатаНачисления</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ДатаСписания</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СуммаБонусныхБаллов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>БонуснаяПрограммаЛояльности</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Catalogs/КассыККМ/КассыККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>КассыККМ</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <owners>Checked</owners>
  </extension>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

trade_exp/src/DataProcessors/БезналичнаяОплатаБезПодключенияОборудования/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
 
 Функция ПолучитьСменуАТОЛ(Касса) 
	Адрес = Касса.IP;
	Порт = Касса.Порт;
	Логин = ?(ЗначениеЗаполнено(Касса.ПользовательУстройства), Касса.ПользовательУстройства, Неопределено);
	Пароль = ?(ЗначениеЗаполнено(Касса.ПарольУстройства), Касса.ПарольУстройства, Неопределено);
	ИДУстройства = Касса.ИДУстройства;
	
	ПараметрыПодключения = АТОЛСревер.ПолучитьПараметрыСоединения(Адрес, Порт, Логин, Пароль, Ложь, ИДУстройства);
	ПараметрыПодключения.Таймаут = 5;
	
	ПараметрыАТОЛ = АТОЛСревер.ШаблонПараметровАТОЛ();
	ПараметрыАТОЛ.ПараметрыПодключения = ПараметрыПодключения;
	ПараметрыАТОЛ.ИДУстройства = ПараметрыПодключения.ИДУстройства;
	ПараметрыАТОЛ.Кассир = Касса.Кассир;
	ПараметрыАТОЛ.НеПечататьЧек = Касса.НеПечататьЧек;
	
	Ответ = АТОЛСревер.ПроверитьСвязь(ПараметрыАТОЛ);
	Если Ответ.Свойство("Ошибка") И Ответ.Ошибка Тогда
		Возврат Ответ;
	КонецЕсли;
	
	//Информация о кассовой смене
	ИнформацияОКассовойСмене = АТОЛСревер.ИнформацияОКассовойСмене(ПараметрыАТОЛ);
	
	Если ИнформацияОКассовойСмене.Свойство("Ошибка") И ИнформацияОКассовойСмене.Ошибка Тогда
		ИнформацияОКассовойСмене.Вставить("ПолучениеИнформацииОКассовойСмене", Истина);
		Возврат ИнформацияОКассовойСмене;
	КонецЕсли;	
	
	//Информация О ККТ
	ИнформацияККТ = АТОЛСревер.ИнформацияОККТ(ПараметрыАТОЛ);
	ПараметрыАТОЛ.Вставить("ИнформацияККТ", ИнформацияККТ);
	ПараметрыАТОЛ.Вставить("ИнформацияОКассовойСмене", ИнформацияОКассовойСмене);
	
	Возврат ПараметрыАТОЛ; 
КонецФункции 

Функция ПроверитьАктуальностьСменыАТОЛ(Касса) Экспорт     
	
	ДействияСКассовойСменой = Новый Структура();                     
	ДействияСКассовойСменой.Вставить("НеобходимоЗакрытьСмену", Ложь);
	ДействияСКассовойСменой.Вставить("НеобходимоОткрытьСмену", Ложь);
	ДействияСКассовойСменой.Вставить("ДатаЗакрытияСмены", Дата(1, 1, 1));
	ДействияСКассовойСменой.Вставить("ТекстОшибки", "");
	ДействияСКассовойСменой.Вставить("Статус", ""); 
	
	// Получение кассовой смены АТОЛ
	ПараметрыАТОЛ = ПолучитьСменуАТОЛ(Касса);
	Если ПараметрыАТОЛ.Свойство("Ошибка") И ПараметрыАТОЛ.Ошибка Тогда
		Текст= ПараметрыАТОЛ.ТекстСообщения;
		ЗаписьЖурналаРегистрации("БезналичнаяОплатаБезПодключенияОборудования", УровеньЖурналаРегистрации.Ошибка, , , Текст);
		Ответ = ПараметрыАТОЛ;
		Если ПараметрыАТОЛ.Свойство("ПолучениеИнформацииОКассовойСмене") Тогда
			Ответ.ТекстСообщения = "Невозможно получить информацию по кассовой смене. Проверьте работу кассы";
		Иначе
			Ответ.ТекстСообщения = "Сервер АТОЛ недоступен";
		КонецЕсли;
		АТОЛСревер.ЗаписатьЛогВФайл(Касса, "", Ответ, Ответ.ТекстСообщения);
		ДействияСКассовойСменой.ТекстОшибки = Ответ.ТекстСообщения;    
		
		Возврат ДействияСКассовойСменой;
	КонецЕсли;  
	
	Если ПараметрыАТОЛ.Свойство("ИнформацияОКассовойСмене") И ПараметрыАТОЛ.ИнформацияОКассовойСмене.Свойство("state") Тогда
		ДействияСКассовойСменой.Вставить("Статус", ПараметрыАТОЛ.ИнформацияОКассовойСмене.state);

		Если ПараметрыАТОЛ.ИнформацияОКассовойСмене.state = "expired" Тогда // Смена истекла
			ДействияСКассовойСменой.НеобходимоЗакрытьСмену = Истина;
			ДействияСКассовойСменой.НеобходимоОткрытьСмену = Истина;    
			
		ИначеЕсли ПараметрыАТОЛ.ИнформацияОКассовойСмене.state = "closed" Тогда // Смена закрыта                                                       
			ДействияСКассовойСменой.НеобходимоОткрытьСмену = Истина;
			
		Иначе	// Смена открыта
			Если ПараметрыАТОЛ.ИнформацияОКассовойСмене.Свойство("expiredAt") Тогда // Дата окончания смены
				ДатаЗакрытияСмены = Дата(1, 1, 1);
				Попытка
					ДатаЗакрытияСмены = ПрочитатьДатуJSON(ПараметрыАТОЛ.ИнформацияОКассовойСмене.expiredAt, ФорматДатыJSON.ISO);
				Исключение
				КонецПопытки;
				
				// Если смена закрывается уже сегодняшним днем, то переоткрыть
				Если Не ЗначениеЗаполнено(ДатаЗакрытияСмены) Или ДатаЗакрытияСмены <= КонецДня(ТекущаяДата()) Тогда 
					ДействияСКассовойСменой.НеобходимоЗакрытьСмену = Истина;
					ДействияСКассовойСменой.НеобходимоОткрытьСмену = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;    
	
	Если ДействияСКассовойСменой.НеобходимоЗакрытьСмену Тогда
		Ответ = АТОЛСревер.ЗакрытьСмену(ПараметрыАТОЛ);
	КонецЕсли;    
	
	Если ДействияСКассовойСменой.НеобходимоОткрытьСмену Тогда
		Ответ = АТОЛСревер.ОткрытьСмену(ПараметрыАТОЛ);
	КонецЕсли;  
	
	// Получение состояния смены (требует времени)
	КоличествоПопыток = 3;
	Таймаут = 1;
	Пока КоличествоПопыток > 0 Цикл   
		
		ПараметрыАТОЛ = ПолучитьСменуАТОЛ(Касса);
		Если ПараметрыАТОЛ.Свойство("ИнформацияОКассовойСмене") И ПараметрыАТОЛ.ИнформацияОКассовойСмене.Свойство("state") И ПараметрыАТОЛ.ИнформацияОКассовойСмене.state = "opened" Тогда 
			Прервать;
		Иначе
			КоличествоПопыток = КоличествоПопыток - 1;
			Б_ОбменССайтомСервер.Таймаут(Таймаут);
		КонецЕсли;	
	КонецЦикла; 	
	
	Если ПараметрыАТОЛ.Свойство("ИнформацияОКассовойСмене") И ПараметрыАТОЛ.ИнформацияОКассовойСмене.Свойство("state") Тогда  
		Если ПараметрыАТОЛ.ИнформацияОКассовойСмене.state <> "opened" Тогда 
			ДействияСКассовойСменой.ТекстОшибки = "Смена АТОЛ не открыта";		
		КонецЕсли;
		
		Если ПараметрыАТОЛ.ИнформацияОКассовойСмене.Свойство("expiredAt") Тогда // Дата окончания смены
			ДатаЗакрытияСмены = Дата(1, 1, 1);
			Попытка
				ДатаЗакрытияСмены = ПрочитатьДатуJSON(ПараметрыАТОЛ.ИнформацияОКассовойСмене.expiredAt, ФорматДатыJSON.ISO);
			Исключение
			КонецПопытки; 
			
			ДействияСКассовойСменой.ДатаЗакрытияСмены = ДатаЗакрытияСмены;
		КонецЕсли;		
		
	КонецЕсли;  
	
	Возврат ДействияСКассовойСменой;
КонецФункции      

Функция ЗакрытьСменуАТОЛ(Касса) Экспорт      
	
	// Получение кассовой смены АТОЛ
	ПараметрыАТОЛ = ПолучитьСменуАТОЛ(Касса);
	Если ПараметрыАТОЛ.Свойство("Ошибка") И ПараметрыАТОЛ.Ошибка Тогда
		Текст= ПараметрыАТОЛ.ТекстСообщения;
		ЗаписьЖурналаРегистрации("БезналичнаяОплатаБезПодключенияОборудования", УровеньЖурналаРегистрации.Ошибка, , , Текст);
		Ответ = ПараметрыАТОЛ;
		Если ПараметрыАТОЛ.Свойство("ПолучениеИнформацииОКассовойСмене") Тогда
			Ответ.ТекстСообщения = "Невозможно получить информацию по кассовой смене. Проверьте работу кассы";
		Иначе
			Ответ.ТекстСообщения = "Сервер АТОЛ недоступен";
		КонецЕсли;
		АТОЛСревер.ЗаписатьЛогВФайл(Касса, "", Ответ, Ответ.ТекстСообщения);
		
		Возврат Ответ.ТекстСообщения;
	КонецЕсли;  
	
			
	Если ПараметрыАТОЛ.Свойство("ИнформацияОКассовойСмене") И ПараметрыАТОЛ.ИнформацияОКассовойСмене.Свойство("state") 
		И ПараметрыАТОЛ.ИнформацияОКассовойСмене.state <> "closed" Тогда 
		
		Ответ = АТОЛСревер.ЗакрытьСмену(ПараметрыАТОЛ);	      
		
		// Получение нового состояния смены (требует времени)
		КоличествоПопыток = 3;
		Таймаут = 1;
		Пока КоличествоПопыток > 0 Цикл   
			
			ПараметрыАТОЛ = ПолучитьСменуАТОЛ(Касса);
			Если ПараметрыАТОЛ.Свойство("ИнформацияОКассовойСмене") И ПараметрыАТОЛ.ИнформацияОКассовойСмене.Свойство("state") И ПараметрыАТОЛ.ИнформацияОКассовойСмене.state = "closed" Тогда 
				Прервать;
			Иначе
				КоличествоПопыток = КоличествоПопыток - 1;
				Б_ОбменССайтомСервер.Таймаут(Таймаут);
			КонецЕсли;	
		КонецЦикла; 
		
		// После попытки закрытия смены
		Если ПараметрыАТОЛ.Свойство("ИнформацияОКассовойСмене") И ПараметрыАТОЛ.ИнформацияОКассовойСмене.Свойство("state") 
			И ПараметрыАТОЛ.ИнформацияОКассовойСмене.state <> "closed" Тогда 
			
			Возврат "Смена АТОЛ не закрыта"
		КонецЕсли; 		
	КонецЕсли;
	
	Возврат "";
КонецФункции

 Функция ПоДокументуОплатыПробитЧек(Документ) Экспорт
	
	Если ЗначениеЗаполнено(Документ) Тогда
		ФискальнаяОперацияДанныеЖурнала = ФормированиеФискальныхЧековСервер.ДанныеПробитогоФискальногоЧекаПоДокументу(Документ);
	Иначе
		ФискальнаяОперацияДанныеЖурнала = Неопределено;
	КонецЕсли;
	
	Возврат Не ФискальнаяОперацияДанныеЖурнала = Неопределено;
	
КонецФункции

Функция ПроверитьАктуальностьСменыККМ(КассаККМ, ДействияСКассовойСменойАТОЛ) Экспорт
	
	РезультатПроверки = Новый Структура();
	РезультатПроверки.Вставить("КассоваяСмена", ПредопределенноеЗначение("Документ.КассоваяСмена.ПустаяСсылка"));	
	РезультатПроверки.Вставить("ОписаниеОшибки", "");
	
	ОшибкаПриСнятииZОтчета = Ложь;       
	ОписаниеОшибки = "";                                                                            
	Если ЗначениеЗаполнено(КассаККМ) Тогда  
		
		СтруктураСостояниеКассовойСмены = ПолучитьСостояниеКассовойСмены(КассаККМ); 
		
		Если ДействияСКассовойСменойАТОЛ.НеобходимоОткрытьСмену 
			Или КонецДня(СтруктураСостояниеКассовойСмены.ДатаИзмененияСтатуса) + 1 < НачалоДня(ДействияСКассовойСменойАТОЛ.ДатаЗакрытияСмены) Тогда            
			
			// Закрыть кассовую смену, если она открыта
			Если СтруктураСостояниеКассовойСмены.СтатусКассовойСмены = Перечисления.СтатусыКассовойСмены.Открыта
				Или (СтруктураСостояниеКассовойСмены.СтатусКассовойСмены = Перечисления.СтатусыКассовойСмены.Закрыта
			  		И  СтруктураСостояниеКассовойСмены.СтатусРегламентныхОпераций = Перечисления.СтатусыРегламентныхОперацийКассовойСмены.ПустаяСсылка()) Тогда
			
				ВыполнитьОперациюЗакрытияКассовойСмены(КассаККМ, Ложь, ОшибкаПриСнятииZОтчета, ОписаниеОшибки);
				СтруктураСостояниеКассовойСмены = ПолучитьСостояниеКассовойСмены(КассаККМ);	
			КонецЕсли; 
			
			// Открыть кассовую смену, если она закрыта
			Если СтруктураСостояниеКассовойСмены.СтатусКассовойСмены = Перечисления.СтатусыКассовойСмены.Закрыта ИЛИ
				СтруктураСостояниеКассовойСмены.СтатусКассовойСмены =  Неопределено Тогда
				ОткрытьКассовуюСмену(КассаККМ, ОписаниеОшибки);	
				СтруктураСостояниеКассовойСмены = ПолучитьСостояниеКассовойСмены(КассаККМ);	
			КонецЕсли;
		КонецЕсли;
		
		
		Если СтруктураСостояниеКассовойСмены.СтатусКассовойСмены = Перечисления.СтатусыКассовойСмены.Закрыта И  
			ДействияСКассовойСменойАТОЛ.Статус = "opened" Тогда
            ОткрытьКассовуюСмену(КассаККМ, ОписаниеОшибки);	
			СтруктураСостояниеКассовойСмены = ПолучитьСостояниеКассовойСмены(КассаККМ);
		КонецЕсли;
		
		Если СтруктураСостояниеКассовойСмены.СтатусКассовойСмены = Перечисления.СтатусыКассовойСмены.Открыта Тогда
			РезультатПроверки.КассоваяСмена = СтруктураСостояниеКассовойСмены.КассоваяСмена; 
		Иначе     
			ОписаниеОшибки = "Кассовая смена ККМ не открыта. " + ОписаниеОшибки;
		КонецЕсли;
		
	Иначе
		ОписаниеОшибки = "Отсутствует касса ККМ";			
	КонецЕсли;
	
	РезультатПроверки.ОписаниеОшибки = ОписаниеОшибки;  
	
	Возврат РезультатПроверки; 
	
КонецФункции 

Функция ПолучитьСостояниеКассовойСмены(КассаККМ) 
	
	УстановитьПривилегированныйРежим(Истина);
		
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КассоваяСмена.Номер                      КАК НомерКассовойСмены,
	|	КассоваяСмена.Ссылка                     КАК КассоваяСмена,
	|	КассоваяСмена.Статус                     КАК СтатусКассовойСмены,
	|	КассоваяСмена.СтатусРегламентныхОпераций КАК СтатусРегламентныхОпераций,
	|	
	|	КассоваяСмена.Организация          КАК Организация,
	|	КассоваяСмена.КассаККМ             КАК КассаККМ,
	|	КассоваяСмена.ФискальноеУстройство КАК ФискальноеУстройство,
	|	
	|	ВЫБОР
	|		КОГДА КассоваяСмена.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСмены.Открыта)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СменаОткрыта,
	|	
	|	ВЫБОР
	|		КОГДА КассоваяСмена.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСмены.Открыта)
	|			ТОГДА КассоваяСмена.НачалоКассовойСмены
	|		ИНАЧЕ КассоваяСмена.ОкончаниеКассовойСмены
	|	КОНЕЦ КАК ДатаИзмененияСтатуса
	|ИЗ
	|	Документ.КассоваяСмена КАК КассоваяСмена
	|ГДЕ
	|	КассоваяСмена.Проведен
	|	И (КассоваяСмена.КассаККМ = &КассаККМ И &КассаККМ <> Неопределено)
	|
	|УПОРЯДОЧИТЬ ПО
	|	КассоваяСмена.Дата УБЫВ,
	|	КассоваяСмена УБЫВ";
	
	Запрос.УстановитьПараметр("КассаККМ",             КассаККМ);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ОписаниеКассовойСмены = ОписаниеКассовойСмены();
	
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(ОписаниеКассовойСмены, Выборка);
		
		Если (ТекущаяДатаСеанса() - ОписаниеКассовойСмены.ДатаИзмененияСтатуса >= 86400)
			И Выборка.СменаОткрыта Тогда
			ОписаниеКассовойСмены.Ошибка24Часа = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КассаККМ) Тогда
		ЗаполнитьОписаниеКассовойСменыПоКассеККМ(ОписаниеКассовойСмены, КассаККМ);
	КонецЕсли;
	
	Возврат ОписаниеКассовойСмены;
	
КонецФункции
  
Функция ЗакрытьКассовуюСмену(КассаККМ, ОписаниеОшибки = "") Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Истина;
	
	СтруктураСостояниеКассовойСмены = ПолучитьСостояниеКассовойСмены(КассаККМ);
	
	Если СтруктураСостояниеКассовойСмены.СтатусКассовойСмены = Перечисления.СтатусыКассовойСмены.Открыта
		Или (СтруктураСостояниеКассовойСмены.СтатусКассовойСмены = Перечисления.СтатусыКассовойСмены.Закрыта
		  И  СтруктураСостояниеКассовойСмены.СтатусРегламентныхОпераций = Перечисления.СтатусыРегламентныхОперацийКассовойСмены.ПустаяСсылка()) Тогда
		
		Если СтруктураСостояниеКассовойСмены.ДатаИзмененияСтатуса <= ТекущаяДатаСеанса() Тогда
		
			КассоваяСменаОбъект = СтруктураСостояниеКассовойСмены.КассоваяСмена.ПолучитьОбъект();
			КассоваяСменаОбъект.Статус                     = Перечисления.СтатусыКассовойСмены.Закрыта;
			КассоваяСменаОбъект.СтатусРегламентныхОпераций = Перечисления.СтатусыРегламентныхОперацийКассовойСмены.СозданОтчет;
			КассоваяСменаОбъект.ОкончаниеКассовойСмены     = ТекущаяДатаСеанса();
			Попытка
				КассоваяСменаОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				
				Результат = Ложь;
				
				ОписаниеОшибки = НСтр("ru = 'При закрытии кассовой смены произошла ошибка.
				                            |Дополнительное описание:
				                            |%ДополнительноеОписание%'");
				ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%ДополнительноеОписание%", ИнформацияОбОшибке().Описание);
				
			КонецПопытки;
			
		Иначе
			Результат = Ложь;
			ОписаниеОшибки = НСтр("ru = 'При закрытии кассовой смены произошла ошибка.
			                            |Дополнительное описание:
			                            |Дата закрытия кассовой смены меньше даты последнего изменения статуса кассовой смены.'");
		КонецЕсли;
		
	Иначе
		
		// Смена не открыта.
		
	КонецЕсли;
	
	Возврат ?(Результат, СтруктураСостояниеКассовойСмены, Неопределено);
	
КонецФункции

Функция ОткрытьКассовуюСмену(КассаККМ, ОписаниеОшибки = "") Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Истина;
	
	СтруктураСостояниеКассовойСмены = ПолучитьСостояниеКассовойСмены(КассаККМ);
	
	ДатаОткрытияКассовойСмены = ТекущаяДатаСеанса();
	
	Если СтруктураСостояниеКассовойСмены.СтатусКассовойСмены = Перечисления.СтатусыКассовойСмены.Открыта Тогда
		
		// Если смена открыта, то с момента открытия должно пройти не больше чем 24 часа.
		Если СтруктураСостояниеКассовойСмены.Ошибка24Часа Тогда
			
			Результат = Ложь;
			// Вероятно, что смена была не закрыта.
			ОписаниеОшибки = РозничныеПродажи.ОписаниеОшибки24Часа();
			
		КонецЕсли;
		
	Иначе
		
		// Смена закрыта. Откроем новую кассовую смену.
		
		НоваяКассоваяСмена = Документы.КассоваяСмена.СоздатьДокумент();
		НоваяКассоваяСмена.Заполнить(Новый Структура("КассаККМ", КассаККМ));
		
		НоваяКассоваяСмена.Организация            = СтруктураСостояниеКассовойСмены.Организация;
		НоваяКассоваяСмена.КассаККМ               = КассаККМ;
		НоваяКассоваяСмена.Дата                   = ДатаОткрытияКассовойСмены;
		НоваяКассоваяСмена.Статус                 = Перечисления.СтатусыКассовойСмены.Открыта;
		НоваяКассоваяСмена.НачалоКассовойСмены    = ДатаОткрытияКассовойСмены;
		НоваяКассоваяСмена.ОкончаниеКассовойСмены = '00010101';
		
		Если НоваяКассоваяСмена.ПроверитьЗаполнение() Тогда
			НоваяКассоваяСмена.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			Результат = Ложь;
			ОписаниеОшибки = ПолучитьТекстОшибкиЗаполненияОтчета();
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ВыполнитьОперациюЗакрытияКассовойСмены(КассаККМ, ОтчетОРозничныхПродажахНаТекущуюДату = Истина, ОшибкаПриСнятииZОтчета, ОписаниеОшибки = "") Экспорт
	
		
	// Закрытие кассовой смены
	НачатьТранзакцию();
	Попытка
		
		КассоваяСмена = ЗакрытьКассовуюСмену(КассаККМ, ОписаниеОшибки);
		Если КассоваяСмена = Неопределено Тогда
			ОтменитьТранзакцию();
			Возврат;
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Розничные продажи'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		Возврат;
		
	КонецПопытки;
	
	Если ЗначениеЗаполнено(КассаККМ) Тогда		
		
		ДатаОтчетаОРозничныхПродажах = ТекущаяДата();
		Если Не ОтчетОРозничныхПродажахНаТекущуюДату Тогда
			ПоследняяДатаПродажи = ПолучитьПоследнююДатуПродажи(КассаККМ);
			
			Если ПоследняяДатаПродажи <> Дата(1, 1, 1) Тогда
				
				ДатаЗакрытияСменыПоУмолчанию = Дата(Год(ПоследняяДатаПродажи), Месяц(ПоследняяДатаПродажи), День(ПоследняяДатаПродажи), 20, 30, 0);
				
				ДатаОтчетаОРозничныхПродажах = ?(ДатаЗакрытияСменыПоУмолчанию < ПоследняяДатаПродажи, 
									ПоследняяДатаПродажи + 1, ДатаЗакрытияСменыПоУмолчанию);
				КассоваяСмена.ДатаИзмененияСтатуса = ДатаОтчетаОРозничныхПродажах;
			КонецЕсли;                                                                             
		КонецЕсли;								
		
		// Заполнение отчета о розничных продажах
		ОтчетОРозничныхПродажах = РозничныеПродажи.ЗаполнитьОтчетыОРозничныхПродажахИВозвратах(КассоваяСмена, ОписаниеОшибки);
		РозничныеПродажи.ВыполнитьПроведениеВозвратов(КассоваяСмена.КассоваяСмена);
	КонецЕсли;
		
КонецПроцедуры

Функция ПолучитьПоследнююДатуПродажи(КассаККМ)
	
	ПоследняяДатаПродажи = Дата(1, 1, 1);
	
	Если ЗначениеЗаполнено(КассаККМ)  Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ 
		|	МАКСИМУМ(Дата) КАК Дата
		|ИЗ 
		|	Документ.ЧекККМ
		|ГДЕ 
		|	КассаККМ = &КассаККМ  
		|	И Проведен
		|	И Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит)";
		
		Запрос.УстановитьПараметр("КассаККМ", КассаККМ);
		Выборка = Запрос.Выполнить().Выбрать();
		
		ПоследняяДатаПродажи = Дата(1, 1, 1);
		Если Выборка.Следующий() Тогда   
			Если ЗначениеЗаполнено(Выборка.Дата) Тогда
				ПоследняяДатаПродажи = Выборка.Дата;
			КонецЕсли;
		КонецЕсли;   
		
	КонецЕсли;
	
	Возврат ПоследняяДатаПродажи;         
	
КонецФункции 

Функция ПолучитьТекстОшибкиЗаполненияОтчета()
	Возврат НСтр("ru = 'Проверьте настройки розничного склада и кассы ККМ.'");
КонецФункции   

Функция ОписаниеКассовойСмены()
	
	СостояниеКассовойСмены = Новый Структура;
	СостояниеКассовойСмены.Вставить("ДатаИзмененияСтатуса", Дата(1, 1, 1));
	СостояниеКассовойСмены.Вставить("СтатусКассовойСмены");
	СостояниеКассовойСмены.Вставить("СтатусРегламентныхОпераций");
	СостояниеКассовойСмены.Вставить("КассоваяСмена");
	СостояниеКассовойСмены.Вставить("НаличностьВКассе");
	СостояниеКассовойСмены.Вставить("НомерКассовойСмены");
	СостояниеКассовойСмены.Вставить("СменаОткрыта", Ложь);
	СостояниеКассовойСмены.Вставить("Ошибка24Часа", Ложь);
	СостояниеКассовойСмены.Вставить("ОписаниеОшибки", "");
	СостояниеКассовойСмены.Вставить("ОбновлятьОтчеты", Истина);
	
	// Описание реквизитов кассовой смены
	СостояниеКассовойСмены.Вставить("Организация");
	СостояниеКассовойСмены.Вставить("КассаККМ");
	СостояниеКассовойСмены.Вставить("ФискальноеУстройство");
	
	СостояниеКассовойСмены.Вставить("Валюта");
	СостояниеКассовойСмены.Вставить("ВалютаПредставление");
	СостояниеКассовойСмены.Вставить("ВидЦены");
	СостояниеКассовойСмены.Вставить("Кассир");
	СостояниеКассовойСмены.Вставить("Склад");
	СостояниеКассовойСмены.Вставить("Подразделение");
	СостояниеКассовойСмены.Вставить("АдресСклада", "");
	СостояниеКассовойСмены.Вставить("ЦенаВключаетНДС");
	СостояниеКассовойСмены.Вставить("НалогообложениеНДС");
	
	// Прочее
	СостояниеКассовойСмены.Вставить("СведенияООрганизации");
	СостояниеКассовойСмены.Вставить("СерийныйНомерККМ",       "");
	СостояниеКассовойСмены.Вставить("СистемаНалогообложения", Перечисления.ТипыСистемНалогообложенияККТ.ПустаяСсылка());
	
	Возврат СостояниеКассовойСмены;
	
КонецФункции

Процедура ЗаполнитьОписаниеКассовойСменыПоКассеККМ(ОписаниеКассовойСмены, КассаККМ)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ДенежныеСредстваВКассахККМОстатки.СуммаОстаток, 0) КАК НаличностьВКассе,
	|	КассыККМ.ВалютаДенежныхСредств                              КАК Валюта,
	|	КассыККМ.ВалютаДенежныхСредств.Представление                КАК ВалютаПредставление,
	|	КассыККМ.Склад                                  КАК Склад,
	|	КассыККМ.Склад.РозничныйВидЦены                 КАК ВидЦены,
	|	КассыККМ.Склад.РозничныйВидЦены.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	КассыККМ.Владелец                               КАК Организация,
	|	КассыККМ.Подразделение                          КАК Подразделение
	|ИЗ
	|	Справочник.КассыККМ КАК КассыККМ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДенежныеСредстваВКассахККМ.Остатки(, КассаККМ = &КассаККМ) КАК ДенежныеСредстваВКассахККМОстатки
	|		ПО (ДенежныеСредстваВКассахККМОстатки.КассаККМ = КассыККМ.Ссылка)
	|ГДЕ
	|	КассыККМ.Ссылка = &КассаККМ");
		
	Запрос.УстановитьПараметр("КассаККМ", КассаККМ);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	ОписаниеКассовойСмены.КассаККМ            = КассаККМ;
	ОписаниеКассовойСмены.Склад               = Выборка.Склад;
	ОписаниеКассовойСмены.ВидЦены             = Выборка.ВидЦены;
	ОписаниеКассовойСмены.ЦенаВключаетНДС     = Выборка.ЦенаВключаетНДС;
	ОписаниеКассовойСмены.Организация         = Выборка.Организация;
	ОписаниеКассовойСмены.НаличностьВКассе    = Выборка.НаличностьВКассе;
	ОписаниеКассовойСмены.Валюта              = Выборка.Валюта;
	ОписаниеКассовойСмены.ВалютаПредставление = Выборка.ВалютаПредставление;
	ОписаниеКассовойСмены.Подразделение       = Выборка.Подразделение;
	
	ПараметрыНалогообложения = УчетНДСУПКлиентСервер.ПараметрыЗаполненияНалогообложенияНДСПродажи();
	ЗаполнитьЗначенияСвойств(ПараметрыНалогообложения, Выборка);
	ПараметрыНалогообложения.Дата = ТекущаяДатаСеанса();
	ПараметрыНалогообложения.РеализацияТоваров = Истина;
	ПараметрыНалогообложения.РеализацияРаботУслуг = Истина;
	ПараметрыНалогообложения.РозничнаяПродажа = Истина;

	УчетНДСУП.ЗаполнитьНалогообложениеНДСПродажи(ОписаниеКассовойСмены.НалогообложениеНДС,ПараметрыНалогообложения);
	
	ОписаниеКассовойСмены.СведенияООрганизации = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Выборка.Организация, ТекущаяДатаСеанса());
	ОписаниеКассовойСмены.АдресСклада          = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Выборка.Склад, Справочники.ВидыКонтактнойИнформации.АдресСклада);
	
	Если ОписаниеКассовойСмены.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД Тогда
		ОписаниеКассовойСмены.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.ЕНВД;
	//++ Локализация
	ИначеЕсли ОписаниеКассовойСмены.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаПоПатенту Тогда
		ОписаниеКассовойСмены.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.Патент;
	//-- Локализация
	Иначе
		ОписаниеКассовойСмены.СистемаНалогообложения = РозничныеПродажиЛокализация.СистемаНалогообложенияФискальнойОперации(Выборка.Организация);
	КонецЕсли;
КонецПроцедуры

Процедура ДобавитьОплатуИПробитьДокументСБП(ДокументОплаты,Касса,КассаККМ,Терминал,СуммаОплаты,НомерКарты,КодАвторизации,НомерЧекаЭТ,АдресУведомленияКлиента,ПечататьЧек,ДокументПродажи) Экспорт
		
	УстановитьПривилегированныйРежим(Истина);   
	     
	ДокОбъект = ДокументОплаты.ПолучитьОбъект();  
	
	//тест
	ДействияСКассовойСменойАТОЛ = ПроверитьАктуальностьСменыАТОЛ(Касса);
	
	Если ДействияСКассовойСменойАТОЛ.ТекстОшибки <> "" Тогда
		Сообщить(ДействияСКассовойСменойАТОЛ.ТекстОшибки);
		Возврат;					
	КонецЕсли;	
	
	// Создать документы КассоваяСмена и ОтчетОРозничныхПродажах        
	
	//тест
	ПроверкаКассовойСменыККМ = ПроверитьАктуальностьСменыККМ(КассаККМ, ДействияСКассовойСменойАТОЛ);
	
	Если ПроверкаКассовойСменыККМ.ОписаниеОшибки <> "" Тогда
		Сообщить(ПроверкаКассовойСменыККМ.ОписаниеОшибки);
		Возврат;					
	КонецЕсли; 

	Если ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.ЧекККМ")  Тогда	
		
		Область = "Документ.ЧекККМ";
		ВозвратОплаты = Ложь;;
		
		// Фиксирование оплаты картой           
		//ДокОбъект.ОплатаПлатежнымиКартами.Очистить();
		//СтрокаОплатыКартой = ДокОбъект.ОплатаПлатежнымиКартами.Добавить();
		//СтрокаОплатыКартой.ВидОплаты = Перечисления.ТипыПлатежнойСистемыККТ.ПлатежнаяКарта;
		//СтрокаОплатыКартой.ЭквайринговыйТерминал = Терминал;
		//СтрокаОплатыКартой.НомерПлатежнойКарты   = НомерКарты; // Возможна запись пустого номера карты или номера вида "****************"
		//СтрокаОплатыКартой.Сумма                 = СуммаОплаты;
		//СтрокаОплатыКартой.КодАвторизации        = КодАвторизации;
		//СтрокаОплатыКартой.НомерЧекаЭТ           = НомерЧекаЭТ;
		
		ДокОбъект.Дата = ТекущаяДатаСеанса();
		ДокОбъект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЧековККМ.Пробит");
		ДокОбъект.КассаККМ = КассаККМ; 
		ДокОбъект.ФормаОплаты = ПредопределенноеЗначение("Перечисление.ФормыОплаты.ПлатежнаяКарта");

		//Если ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.ЧекККМ") Тогда
		//	ДокОбъект.ФормаОплаты = ПредопределенноеЗначение("Перечисление.ФормыОплаты.ПлатежнаяКарта");
		//КонецЕсли;
		
		//тест
		Если ЗначениеЗаполнено(ПроверкаКассовойСменыККМ.КассоваяСмена) Тогда  
			ДокОбъект.КассоваяСмена = ПроверкаКассовойСменыККМ.КассоваяСмена;
		КонецЕсли; 
		
	ИначеЕсли ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.ЧекККМВозврат") Тогда 
		
		Область = "Документ.ЧекККМВозврат";
		ВозвратОплаты = Истина;
		ДокОбъект.КассаККМ = КассаККМ; 
		
		ДокОбъект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЧековККМ.Пробит");
		
		//СтрокаОплаты = ДокОбъект.ОплатаПлатежнымиКартами.Получить(0);
		//СтрокаОплаты.ОплатаОтменена = Истина;
		
		//тест
		Если ЗначениеЗаполнено(ПроверкаКассовойСменыККМ.КассоваяСмена) Тогда  
			ДокОбъект.КассоваяСмена = ПроверкаКассовойСменыККМ.КассоваяСмена;
		КонецЕсли; 
		
	Иначе
		
		Область = "Документ.ОперацияПоПлатежнойКарте";
		ВозвратОплаты = Не ДокументОплаты.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента; 		
		
		//ДокОбъект.ОплатаВыполнена = Истина;
		//ДокОбъект.ЭквайринговыйТерминал = Терминал;	
		//ДокОбъект.НомерПлатежнойКарты = НомерКарты;
		//ДокОбъект.СуммаДокумента = СуммаОплаты;
		//ДокОбъект.КодАвторизации = КодАвторизации;
		
	    ФинансыКлиентСервер.ПересчитатьСуммыВСтрокеРасшифровкиПлатежа(ДокОбъект, СуммаОплаты, Ложь);
		
	КонецЕсли;
	
	Подразделение = АльтерраОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументПродажи.Склад, "Подразделение");	

	КассирПользователь = Пользователи.ТекущийПользователь();	
	КассирФизическоеЛицо = Строка(АльтерраОбщегоНазначения.ЗначениеРеквизитаОбъекта(КассирПользователь, "ФизическоеЛицо")) + " - Менеджер";
	
	УдалосьПровести = Ложь;  
	НачатьТранзакцию();
	Попытка
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить();
		ЭлементБлокировки.Область = Область;
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("Ссылка", ДокументОплаты);
		Блокировка.Заблокировать();
		
		РежимПроведения = РежимПроведенияДокумента.Неоперативный;
        Если ДокОбъект.Дата >= НачалоДня(ТекущаяДатаСеанса())
            И ДокументОплаты.Метаданные().ОперативноеПроведение = Метаданные.СвойстваОбъектов.ОперативноеПроведение.Разрешить Тогда
                РежимПроведения = РежимПроведенияДокумента.Оперативный;
        КонецЕсли;
        
        ДокОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведения);  
		
		 //Пробитие чека в АТОЛСервер  
		Ответ = ПробитьДокументОплаты(Касса, КассирФизическоеЛицо, ДокументОплаты, ВозвратОплаты, СуммаОплаты, АдресУведомленияКлиента, "БезналичнаяОплатаБезПодключенияОборудования",ПечататьЧек,ДокументПродажи);	
		
		//убрать после тестирования
		//Ответ = Новый Структура;
		//Ответ.Вставить("Ошибка", Ложь);
		
		Если Ответ.Ошибка Тогда
			ТекстОшибки = НСтр("ru = 'ВНИМАНИЕ! Произошла исключительная ситуация на кассе:
			|Оплата произведена, но данные не отправлены в ОФД.
			|'") + Ответ.ТекстСообщения;
			ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Розничные продажи'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, , ДокОбъект.Ссылка,
			ТекстОшибки);  
			
			ОтменитьТранзакцию();
			
			Сообщить(ТекстОшибки);
			Возврат;			
		КонецЕсли;
		
//		Если ТипЗнч(ДокументПродажи) = Тип("ДокументСсылка.РеализацияТоваровУслуг") ИЛИ 
//			ТипЗнч(ДокументПродажи) = Тип("ДокументСсылка.ЧекККМ") Тогда
//			ДокументПродажиОбъект = ДокументПродажи.ПолучитьОбъект();
//			ДокументПродажиОбъект.Кассир = КассирПользователь;
//			ДокументПродажиОбъект.ДатаОтметкиКасса = ТекущаяДата();
//			ДокументПродажиОбъект.МестоОплаты = Перечисления.МестоОплаты.СтойкаМенеджера;
//			ДокументПродажиОбъект.Записать(РежимЗаписиДокумента.Проведение);
//		КонецЕсли;  
//		Если  ТипЗнч(ДокументПродажи) = Тип("ДокументСсылка.ЧекККМВозврат") ИЛИ
//			ТипЗнч(ДокументПродажи) = Тип("ДокументСсылка.ВозвратТоваровОтКлиента") Тогда
//			ДокументПродажиОбъект = ДокументПродажи.ПолучитьОбъект();
//			ДокументПродажиОбъект.Кассир = КассирПользователь;  
//			ДокументПродажиОбъект.Записать(РежимЗаписиДокумента.Проведение);
//		КонецЕсли;
		
		ЗафиксироватьТранзакцию(); 
		УдалосьПровести = Истина;
	Исключение
		ОтменитьТранзакцию();     
		
		ТекстОшибки = "";
		МассивСообщений = ПолучитьСообщенияПользователю(Истина); 
		Для Каждого Сообщение Из МассивСообщений Цикл
			Если ЗначениеЗаполнено(Сообщение.КлючДанных) Тогда
				ТекстОшибки = ?(ТекстОшибки = "", Сообщение.Текст, ТекстОшибки + Символы.ПС + Сообщение.Текст);
			КонецЕсли;
		КонецЦикла;
		
		ТекстОшибки = НСтр("ru = 'ВНИМАНИЕ! Произошла исключительная ситуация на кассе:
		|Оплата произведена, но не зафиксирована в системе.
		|'") + ТекстОшибки; 
		ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Розничные продажи'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Ошибка,, ДокОбъект.Ссылка,
		ТекстОшибки);  
		
		Сообщить(ТекстОшибки);
		Возврат;			
	КонецПопытки;
	
	Попытка
	Если УдалосьПровести Тогда
		Если ТипЗнч(ДокументПродажи) = Тип("ДокументСсылка.РеализацияТоваровУслуг") ИЛИ 
			ТипЗнч(ДокументПродажи) = Тип("ДокументСсылка.ЧекККМ") Тогда
			ДокументПродажиОбъект = ДокументПродажи.ПолучитьОбъект();
			ДокументПродажиОбъект.Кассир = КассирПользователь;
			ДокументПродажиОбъект.ДатаОтметкиКасса = ТекущаяДата();
			ДокументПродажиОбъект.МестоОплаты = Перечисления.МестоОплаты.СтойкаМенеджера;
			ДокументПродажиОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;  
		Если  ТипЗнч(ДокументПродажи) = Тип("ДокументСсылка.ЧекККМВозврат") ИЛИ
			ТипЗнч(ДокументПродажи) = Тип("ДокументСсылка.ВозвратТоваровОтКлиента") Тогда
			ДокументПродажиОбъект = ДокументПродажи.ПолучитьОбъект();
			ДокументПродажиОбъект.Кассир = КассирПользователь;  
			ДокументПродажиОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
	КонецЕсли;
	Исключение
		ТекстОшибки = "";
		МассивСообщений = ПолучитьСообщенияПользователю(Истина); 
		Для Каждого Сообщение Из МассивСообщений Цикл
			Если ЗначениеЗаполнено(Сообщение.КлючДанных) Тогда
				ТекстОшибки = ?(ТекстОшибки = "", Сообщение.Текст, ТекстОшибки + Символы.ПС + Сообщение.Текст);
			КонецЕсли;
		КонецЦикла;
		ТекстОшибки = ТекстОшибки + ИнформацияОбОшибке().Описание;
		
		ЗаписьЖурналаРегистрации("Ошибка отметки кассы",
		УровеньЖурналаРегистрации.Ошибка,, ДокОбъект.Ссылка, ТекстОшибки);  
	КонецПопытки;
	
КонецПроцедуры

Процедура ДобавитьОплатуИПробитьДокумент(ДокументОплаты,Касса,КассаККМ,Терминал,СуммаОплаты,НомерКарты,КодАвторизации,НомерЧекаЭТ,АдресУведомленияКлиента,ПечататьЧек,ДокументПродажи) Экспорт
		
	УстановитьПривилегированныйРежим(Истина);   
	     
	ДокОбъект = ДокументОплаты.ПолучитьОбъект();  
		
	ДействияСКассовойСменойАТОЛ = ПроверитьАктуальностьСменыАТОЛ(Касса);
	
	Если ДействияСКассовойСменойАТОЛ.ТекстОшибки <> "" Тогда
		Сообщить(ДействияСКассовойСменойАТОЛ.ТекстОшибки);
		Возврат;					
	КонецЕсли;	
	
	// Создать документы КассоваяСмена и ОтчетОРозничныхПродажах        
	
	ПроверкаКассовойСменыККМ = ПроверитьАктуальностьСменыККМ(КассаККМ, ДействияСКассовойСменойАТОЛ);
	
	Если ПроверкаКассовойСменыККМ.ОписаниеОшибки <> "" Тогда
		Сообщить(ПроверкаКассовойСменыККМ.ОписаниеОшибки);
		Возврат;					
	КонецЕсли; 

	Если ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.ЧекККМ")  Тогда	
		
		Область = "Документ.ЧекККМ";
		ВозвратОплаты = Ложь;;
		
		// Фиксирование оплаты картой           
		ДокОбъект.ОплатаПлатежнымиКартами.Очистить();
		СтрокаОплатыКартой = ДокОбъект.ОплатаПлатежнымиКартами.Добавить();
		СтрокаОплатыКартой.ВидОплаты = Перечисления.ТипыПлатежнойСистемыККТ.ПлатежнаяКарта;
		СтрокаОплатыКартой.ЭквайринговыйТерминал = Терминал;
		СтрокаОплатыКартой.НомерПлатежнойКарты   = НомерКарты; // Возможна запись пустого номера карты или номера вида "****************"
		СтрокаОплатыКартой.Сумма                 = СуммаОплаты;
		СтрокаОплатыКартой.КодАвторизации        = КодАвторизации;
		СтрокаОплатыКартой.НомерЧекаЭТ           = НомерЧекаЭТ;
		
		ДокОбъект.Дата = ТекущаяДатаСеанса();
		ДокОбъект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЧековККМ.Пробит");
		ДокОбъект.КассаККМ = КассаККМ; 

		Если ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.ЧекККМ") Тогда
			ДокОбъект.ФормаОплаты = ПредопределенноеЗначение("Перечисление.ФормыОплаты.ПлатежнаяКарта");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПроверкаКассовойСменыККМ.КассоваяСмена) Тогда  
			ДокОбъект.КассоваяСмена = ПроверкаКассовойСменыККМ.КассоваяСмена;
		КонецЕсли; 
		
	ИначеЕсли ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.ЧекККМВозврат") Тогда 
		
		Область = "Документ.ЧекККМВозврат";
		ВозвратОплаты = Истина;
		ДокОбъект.КассаККМ = КассаККМ; 
		
		ДокОбъект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЧековККМ.Пробит");
		
		СтрокаОплаты = ДокОбъект.ОплатаПлатежнымиКартами.Получить(0);
		СтрокаОплаты.ОплатаОтменена = Истина;
		
		Если ЗначениеЗаполнено(ПроверкаКассовойСменыККМ.КассоваяСмена) Тогда  
			ДокОбъект.КассоваяСмена = ПроверкаКассовойСменыККМ.КассоваяСмена;
		КонецЕсли; 
		
	Иначе
		
		Область = "Документ.ОперацияПоПлатежнойКарте";
		ВозвратОплаты = Не ДокументОплаты.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента; 		
		
		ДокОбъект.ОплатаВыполнена = Истина;
		ДокОбъект.ЭквайринговыйТерминал = Терминал;	
		ДокОбъект.НомерПлатежнойКарты = НомерКарты;
		ДокОбъект.СуммаДокумента = СуммаОплаты;
		ДокОбъект.КодАвторизации = КодАвторизации;
		
	    ФинансыКлиентСервер.ПересчитатьСуммыВСтрокеРасшифровкиПлатежа(ДокОбъект, СуммаОплаты, Ложь);
		
	КонецЕсли;
	
	Подразделение = АльтерраОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументПродажи.Склад, "Подразделение");	

	КассирПользователь = Пользователи.ТекущийПользователь();	
	КассирФизическоеЛицо = Строка(АльтерраОбщегоНазначения.ЗначениеРеквизитаОбъекта(КассирПользователь, "ФизическоеЛицо")) + " - Менеджер";
	
	УдалосьПровести = Ложь;  
	НачатьТранзакцию();
	Попытка
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить();
		ЭлементБлокировки.Область = Область;
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("Ссылка", ДокументОплаты);
		Блокировка.Заблокировать();
		
		РежимПроведения = РежимПроведенияДокумента.Неоперативный;
        Если ДокОбъект.Дата >= НачалоДня(ТекущаяДатаСеанса())
            И ДокументОплаты.Метаданные().ОперативноеПроведение = Метаданные.СвойстваОбъектов.ОперативноеПроведение.Разрешить Тогда
                РежимПроведения = РежимПроведенияДокумента.Оперативный;
        КонецЕсли;
        
        ДокОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведения);  
		
		 //Пробитие чека в АТОЛСервер  
		Ответ = ПробитьДокументОплаты(Касса, КассирФизическоеЛицо, ДокументОплаты, ВозвратОплаты, СуммаОплаты, АдресУведомленияКлиента, "БезналичнаяОплатаБезПодключенияОборудования",ПечататьЧек,ДокументПродажи);	
		
		Если Ответ.Ошибка Тогда
			ТекстОшибки = НСтр("ru = 'ВНИМАНИЕ! Произошла исключительная ситуация на кассе:
			|Оплата произведена, но данные не отправлены в ОФД.
			|'") + Ответ.ТекстСообщения;
			ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Розничные продажи'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, , ДокОбъект.Ссылка,
			ТекстОшибки);  
			
			ОтменитьТранзакцию();
			
			Сообщить(ТекстОшибки);
			Возврат;			
		КонецЕсли;
		
//		Если ТипЗнч(ДокументПродажи) = Тип("ДокументСсылка.РеализацияТоваровУслуг") ИЛИ 
//			ТипЗнч(ДокументПродажи) = Тип("ДокументСсылка.ЧекККМ") Тогда
//			ДокументПродажиОбъект = ДокументПродажи.ПолучитьОбъект();
//			ДокументПродажиОбъект.Кассир = КассирПользователь;
//			ДокументПродажиОбъект.ДатаОтметкиКасса = ТекущаяДата();
//			ДокументПродажиОбъект.МестоОплаты = Перечисления.МестоОплаты.СтойкаМенеджера;
//			ДокументПродажиОбъект.Записать(РежимЗаписиДокумента.Проведение);
//		КонецЕсли;  
//		Если  ТипЗнч(ДокументПродажи) = Тип("ДокументСсылка.ЧекККМВозврат") ИЛИ
//			ТипЗнч(ДокументПродажи) = Тип("ДокументСсылка.ВозвратТоваровОтКлиента") Тогда
//			ДокументПродажиОбъект = ДокументПродажи.ПолучитьОбъект();
//			ДокументПродажиОбъект.Кассир = КассирПользователь;  
//			ДокументПродажиОбъект.Записать(РежимЗаписиДокумента.Проведение);
//		КонецЕсли;
		
		ЗафиксироватьТранзакцию(); 
		УдалосьПровести = Истина;
	Исключение
		ОтменитьТранзакцию();     
		
		ТекстОшибки = "";
		МассивСообщений = ПолучитьСообщенияПользователю(Истина); 
		Для Каждого Сообщение Из МассивСообщений Цикл
			Если ЗначениеЗаполнено(Сообщение.КлючДанных) Тогда
				ТекстОшибки = ?(ТекстОшибки = "", Сообщение.Текст, ТекстОшибки + Символы.ПС + Сообщение.Текст);
			КонецЕсли;
		КонецЦикла;
		
		ТекстОшибки = НСтр("ru = 'ВНИМАНИЕ! Произошла исключительная ситуация на кассе:
		|Оплата произведена, но не зафиксирована в системе.
		|'") + ТекстОшибки; 
		ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Розничные продажи'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Ошибка,, ДокОбъект.Ссылка,
		ТекстОшибки);  
		
		Сообщить(ТекстОшибки);
		Возврат;			
	КонецПопытки;
	
	Попытка
		Если УдалосьПровести Тогда
			Если ТипЗнч(ДокументПродажи) = Тип("ДокументСсылка.РеализацияТоваровУслуг") ИЛИ 
				ТипЗнч(ДокументПродажи) = Тип("ДокументСсылка.ЧекККМ") Тогда
				ДокументПродажиОбъект = ДокументПродажи.ПолучитьОбъект();
				ДокументПродажиОбъект.Кассир = КассирПользователь;
				ДокументПродажиОбъект.ДатаОтметкиКасса = ТекущаяДата();
				ДокументПродажиОбъект.МестоОплаты = Перечисления.МестоОплаты.СтойкаМенеджера;
				ДокументПродажиОбъект.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;  
			Если  ТипЗнч(ДокументПродажи) = Тип("ДокументСсылка.ЧекККМВозврат") ИЛИ
				ТипЗнч(ДокументПродажи) = Тип("ДокументСсылка.ВозвратТоваровОтКлиента") Тогда
				ДокументПродажиОбъект = ДокументПродажи.ПолучитьОбъект();
				ДокументПродажиОбъект.Кассир = КассирПользователь;  
				ДокументПродажиОбъект.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
		КонецЕсли;
	Исключение
		ТекстОшибки = "";
		МассивСообщений = ПолучитьСообщенияПользователю(Истина); 
		Для Каждого Сообщение Из МассивСообщений Цикл
			Если ЗначениеЗаполнено(Сообщение.КлючДанных) Тогда
				ТекстОшибки = ?(ТекстОшибки = "", Сообщение.Текст, ТекстОшибки + Символы.ПС + Сообщение.Текст);
			КонецЕсли;
		КонецЦикла;
		ТекстОшибки = ТекстОшибки + ИнформацияОбОшибке().Описание;
		
		ЗаписьЖурналаРегистрации("Ошибка отметки кассы",
		УровеньЖурналаРегистрации.Ошибка,, ДокОбъект.Ссылка, ТекстОшибки); 
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция ПробитьДокументОплаты(Касса, КассирФизическоеЛицо, ДокументОплаты, ВозвратОплаты, СуммаДокумента, АдресУведомленияКлиента, ИмяСобытия,ПечататьЧек,ДокументПродажи)
		
	ПараметрыАТОЛ = АльтерраОбщегоНазначения.ПолучитьПараметрыКассы(Касса, ДокументПродажи, ДокументОплаты, СуммаДокумента, ИмяСобытия);
		
	Отказ = Ложь;
	Если ПараметрыАТОЛ.Свойство("Ошибка") И ПараметрыАТОЛ.Ошибка Тогда
		Текст= ПараметрыАТОЛ.ТекстСообщения;
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , Текст);
		Отказ= Истина;
		Ответ = ПараметрыАТОЛ;
		Если ПараметрыАТОЛ.Свойство("ПолучениеИнформацииОКассовойСмене") Тогда
			Ответ.ТекстСообщения = "Невозможно получить информацию по кассовой смене. Проверьте работу кассы";
		Иначе
			Ответ.ТекстСообщения = "Сервер АТОЛ недоступен";
		КонецЕсли;
		АТОЛСревер.ЗаписатьЛогВФайл(Касса, ДокументОплаты, Ответ, Ответ.ТекстСообщения);		
	КонецЕсли;
	
	ОтказПробитияЧека = Ложь;
	Если Не Отказ Тогда
		
		ПараметрыАТОЛ.Вставить("МестоРасчетов", "Магазин ""Альтерра""");	
		ПараметрыАТОЛ.Вставить("КассирВЧеке", КассирФизическоеЛицо);
		
		Если ВозвратОплаты Тогда                   
			ПараметрыАТОЛ.Вставить("ТипОперации", "sellReturn");
		КонецЕсли;
		
		ПараметрыАТОЛ.EmailИлиТелефон = АдресУведомленияКлиента;
		ПараметрыАТОЛ.Вставить("ОтправлятьЧекИзОФД", Не ПечататьЧек);
		ПараметрыАТОЛ.Вставить("НеПечататьЧек", Не ПечататьЧек);
		
		Если Не Отказ Тогда
			Ответ = АльтерраОбщегоНазначения.ПробитьЧек(ПараметрыАТОЛ, ИмяСобытия, Отказ); 
			АТОЛСревер.ЗаписатьЛогВФайл(Касса, ДокументОплаты, Ответ, "Пробитие чека");
		КонецЕсли;
		
		Если Ответ.Ошибка ИЛИ Не Ответ.Данные.Свойство("uuid") Тогда
			Текст = Ответ.ТекстСообщения;
			Отказ = Истина;
		КонецЕсли;
		
		Если Не Отказ Тогда
			УИД= Ответ.Данные.uuid;
		Иначе
			УИД = XMLСтрока(ДокументОплаты);
			ОтказПробитияЧека = Истина;
			Текст = "По данному чеку было ранее пробитие с ошибкой. Состояние задания: ";
		КонецЕсли;                              
		
		
		Если ОтказПробитияЧека<>Истина Тогда
			КоличествоПопыток = 3;
		Иначе
			КоличествоПопыток = 1;
		КонецЕсли;
		Таймаут = 1;
		Пока КоличествоПопыток>0 Цикл        
			ТекстЗаписиВЛог = "Попытка обращения к АТОЛ: #" + Строка(КоличествоПопыток); 
			АТОЛСревер.ЗаписатьЛогВФайл(Касса, ДокументОплаты, Ответ, ТекстЗаписиВЛог);
			Ответ= АТОЛСревер.РезультатПробитияЧека(ПараметрыАТОЛ, УИД);
			Если Ответ.Ошибка Тогда
				КоличествоПопыток = КоличествоПопыток - 1;
				Б_ОбменССайтомСервер.Таймаут(Таймаут);  
			Иначе
				Прервать;
			КонецЕсли;	
		КонецЦикла;  
		
		АТОЛСревер.ЗаписатьЛогВФайл(Касса, ДокументОплаты, Ответ, "Результат пробития чека на АТОЛ");
	КонецЕсли;
	
	Если Не Отказ И Не Ответ.Ошибка Тогда
		ДанныеФН= Ответ.Данные;
		//ЗаписатьФискальнуюОперацию
		ПараметрыФискализации = АТОЛСревер.ПодготовитьДанныеФискализацииЧека(ПараметрыАТОЛ, ДанныеФН);
		ОборудованиеЧекопечатающиеУстройстваВызовСервера.ЗаписатьФискальнуюОперацию(ПараметрыФискализации);
		
		Возврат АльтерраОбщегоНазначения.ПодготовитьHTTPОтвет(Ложь, "Чек пробит", АдресУведомленияКлиента);
		
	Иначе
		Ошибка = Истина;
		Если ОтказПробитияЧека Тогда
			Ошибка = Не СтрНайти(Ответ.ТекстСообщения, "Данные ФН")>0;
			Если Не Ошибка Тогда
				Текст = "Чек был пробит ранее";
				Ошибка = Ложь;
			Иначе
				Текст = Текст + Ответ.ТекстСообщения;
			КонецЕсли;
		Иначе
			Текст= Ответ.ТекстСообщения;
		КонецЕсли;
		
		Возврат АльтерраОбщегоНазначения.ПодготовитьHTTPОтвет(Ошибка, Текст, "");
		
	КонецЕсли;
		
КонецФункции

#КонецЕсли
